Revit 2026 API

# IFCExportOptionsFamilyMappingFile Property

---

Path to a file containing family mapping.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string FamilyMappingFile { get; set; }
```
```vb
Public Property FamilyMappingFile As String
	Get
	Set
```
```cpp
public:
property String^ FamilyMappingFile {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member FamilyMappingFile : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The file, if specified, contains data describing how to map generic family instances to IFC containers (element types). This property may be empty, in which case the current mapping will be used. The default is an empty string.

#### Reference

IFCExportOptions Class

Autodesk.Revit.DB Namespace